tsung_logs/posts-t3micro-db-i/simple.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="jnlai-t3dt3i.3hfpeaqsam.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="15" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="15" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
  </options>

  <sessions>
    <session name="Make Post" probability="100" type="ts_http">
      <transaction name="Get_Root">
  <request>
          <http url="/"/>
  </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Get_Register">
  <request>
              <dyn_variable name="authenticity_token"/>
                      <http url="/register"/>
  </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
  <var name="authenticity_token"/>
      </setdynvars>

      <setdynvars sourcetype="random_string" length="30">
  <var name="rnd_email"/>
      </setdynvars>

      <setdynvars sourcetype="random_string" length="30">
  <var name="rnd_user"/>
      </setdynvars>

      <thinktime random="true" value="2"/>

      <transaction name="Post_Register">
  <request subst="true">
              <http url="/" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_rnd_email%%@gmail.com&amp;user%5Busername%5D=%%_rnd_user%%&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Sign+up"/>
  </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Redirect_Root">
  <request>
          <http url="/"/>
  </request>
      </transaction>

      <thinktime random="true" value="2"/>

<setdynvars sourcetype="random_number" start="1" end="30">
     <var name="random_book_id"/>
</setdynvars>

      <transaction name="Get_Book">
        <request subst="true">
          <http url="/books/%%_random_book_id%%"/>
        </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Get_New_Post">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url="/posts/new"/>
        </request>
      </transaction>

       <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
     <var name="authenticity_token"/>
       </setdynvars>

      <transaction name="Post_New_Post">
        <request subst="true">
          <dyn_variable name="post_id" re="Location: http://.*/posts/(.*)\r"/>
          <http url="/posts" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;post%5Btitle%5D=tsung_post_title&amp;post%5Bcontent%5D=tsung_post_content&amp;post%5Bbook_id%5D=2&amp;"/>
        </request>
      </transaction>

      <thinktime random="true" value="4"/>

      <transaction name="Redirect_To_New_Post">
      <request subst="true">
            <http url="/posts/%%_post_id%%"/>
      </request>
      </transaction>

    </session>
  </sessions>
</tsung>